fixtures/demo-configuration/src/Catalogs/МобильныеУстройства/МобильныеУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МобильныеУстройства</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ИдентификаторПодписчикаДоставляемыхУведомлений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписчик</name>
    <type>
      <types>ExchangePlanRef.Мобильные</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fixtures/demo-configuration/src/Catalogs/МобильныеУстройства/ManagerModule.bsl
Процедура НовыйИдентификаторПодписчикаУведомлений(Подписчик, Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МобильныеУстройства.Ссылка КАК Ссылка,
	               |	МобильныеУстройства.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.МобильныеУстройства КАК МобильныеУстройства
	               |ГДЕ
	               |	МобильныеУстройства.Подписчик = &Подписчик";	
	Запрос.УстановитьПараметр("Подписчик", Подписчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Устройство = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления = Ложь Тогда
			Устройство = Выборка.Ссылка.ПолучитьОбъект();
			Прервать;
        КонецЕсли;
	КонецЦикла;
	
	Если Устройство = 0 Тогда
        Устройство = СоздатьЭлемент();
		Устройство.Владелец = Пользователи.ТекущийПользователь();
		Устройство.Подписчик = Подписчик;
	КонецЕсли;
	
	Устройство.ИдентификаторПодписчикаДоставляемыхУведомлений = Новый ХранилищеЗначения(Идентификатор);
	Устройство.Записать();
	
КонецПроцедуры
